# Düzenleme Yöntemleri

## İndeks Değerlerini Ayarlamak

## index_col() Parametresi

Veri Çerçevesi (Data Frame) içerisinde bulunan sütunlardan birini, indeks değeri olarak ayarlamak/atamak istersek, **index_col()** fonksiyonunu kullanabiliriz.
Öncelikle elimizdeki excel dosyamızı veri çerçevesine dönüştürüp içeriğine göz atalım.

In [36]:
import pandas as pd

dogumlar = pd.read_excel("Veri_Setleri/AyaGöreDoğumlar.xlsx", sheet_name = "ortalama")
dogumlar.head()

    Yıl   Toplam       Ortalama
0  2001  1323341  110278.416667
1  2002  1229555  102462.916667
2  2003  1198927   99910.583333
3  2004  1222484  101873.666667
4  2005  1244041  103670.083333

Oluşan veri çerçevesindeki **Yıl** sütununu indeks olarak ayarlayalım.

In [37]:
dogumlar = pd.read_excel("Veri_Setleri/AyaGöreDoğumlar.xlsx", sheet_name = "ortalama", index_col=0)
dogumlar.head()

       Toplam       Ortalama
Yıl
2001  1323341  110278.416667
2002  1229555  102462.916667
2003  1198927   99910.583333
2004  1222484  101873.666667
2005  1244041  103670.083333

İşlem başarılı. **Yıl** Sütunu, indeks olarak ayarlandı.

## set_index() metodu

Veri Çerçevelerinin indeks değerlerini **index_col** parametresi ile değiştirebildiğimiz gibi İstersek **set_index()** metodu ile de değiştirebilir / atayabiliriz.
**dogumlar** isimli veri çerçevemizi yeniden oluşturup indeks başlığı **set_index()** metodu ile değiştirelim.

In [38]:
dogumlar = pd.read_excel("Veri_Setleri/AyaGöreDoğumlar.xlsx")
dogumlar

,Yıl,Toplam,Ocak,Şubat,Mart,Nisan,Mayıs,Haziran,Temmuz,Ağustos,Eylül,Ekim,Kasım,Aralık
0,2001,1323341,170397,103476,107912,102585,110391,111722,119752,120963,109590,103662,92554,70337
1,2002,1229555,155065,103446,102175,95976,99501,102627,109747,108061,99701,96216,89285,67755
2,2003,1198927,138670,89548,101046,92574,99531,104644,109225,109159,98766,94838,89542,71384
3,2004,1222484,141538,94596,100696,100801,102214,105728,111102,110425,98492,94840,90833,71219
4,2005,1244041,142311,94234,100529,97441,106833,108536,111066,111430,103273,103310,92364,72714
5,2006,1255432,128708,94760,104126,97624,103903,112016,115097,117298,107158,105773,93167,75802
6,2007,1289992,131276,93927,102807,100159,108119,110359,122324,118169,111055,109888,99639,82270
7,2008,1295511,130424,98099,102962,102877,107003,110089,119977,120048,114470,107978,97389,84195
8,2009,1266751,122407,92414,99419,103432,103783,107847,117160,116229,115824,105407,96155,86674
9,2010,1261169,119444,95023,103583,99477,103676,109441,113639,113082,110324,104427,101610,87443
10,2011,1252812,118547,92484,100992,95348,94131,104086,114390,121152,112959,105048,102970,90705
11,2012,1294605,119556,99966,105499,98880,105807,110056,118649,123634,110338,108327,102413,91480
12,2013,1297505,118373,94803,102471,96865,106757,109672,123758,121625,112913,110716,104182,95370
13,2014,1351088,121694,96802,105603,105652,112448,115978,129616,126296,119030,111754,105566,100649
14,2015,1336908,120373,99169,105792,103110,105254,115681,130945,123296,116428,112839,106319,97702
15,2016,1316204,114274,100640,105166,101947,104080,117994,120126,124833,114366,107951,104959,99868
16,2017,1299419,114968,95567,101700,96132,106274,115827,122894,122386,110811,108538,104386,99936
17,2018,1255258,107530,90002,101283,94776,104719,110383,117967,116715,107105,107818,100436,96524
18,2019,1188524,104044,85510,96631,93013,105166,97965,112628,109182,99981,98320,92936,93148
19,2020,1115821,94888,83433,89503,88526,93159,99232,105970,100478,96018,93428,87540,83646
20,2021,1079842,80733,77535,86214,82789,88506,94266,99252,100407,97334,93290,92189,87327

Veri çerçevesini yeniden (AyaGöreDoğumlar.xlsx isimli excel doyasından içe aktararak) oluşturduğumuz ve **index_col** parametresi kullanmadığımız için, İndeks değerleri Pandas tarafından otomatik olarak oluşturuldu. Bu kez de **Toplam** isimli sütun değerlerini **set_index** metoduyla, indeks değerleri olarak atayalım.

In [39]:
dogumlar.set_index("Toplam")

,Yıl,Ocak,Şubat,Mart,Nisan,Mayıs,Haziran,Temmuz,Ağustos,Eylül,Ekim,Kasım,Aralık
Toplam,,,,,,,,,,,,,
1323341,2001,170397,103476,107912,102585,110391,111722,119752,120963,109590,103662,92554,70337
1229555,2002,155065,103446,102175,95976,99501,102627,109747,108061,99701,96216,89285,67755
1198927,2003,138670,89548,101046,92574,99531,104644,109225,109159,98766,94838,89542,71384
1222484,2004,141538,94596,100696,100801,102214,105728,111102,110425,98492,94840,90833,71219
1244041,2005,142311,94234,100529,97441,106833,108536,111066,111430,103273,103310,92364,72714
1255432,2006,128708,94760,104126,97624,103903,112016,115097,117298,107158,105773,93167,75802
1289992,2007,131276,93927,102807,100159,108119,110359,122324,118169,111055,109888,99639,82270
1295511,2008,130424,98099,102962,102877,107003,110089,119977,120048,114470,107978,97389,84195
1266751,2009,122407,92414,99419,103432,103783,107847,117160,116229,115824,105407,96155,86674
1261169,2010,119444,95023,103583,99477,103676,109441,113639,113082,110324,104427,101610,87443
1252812,2011,118547,92484,100992,95348,94131,104086,114390,121152,112959,105048,102970,90705
1294605,2012,119556,99966,105499,98880,105807,110056,118649,123634,110338,108327,102413,91480
1297505,2013,118373,94803,102471,96865,106757,109672,123758,121625,112913,110716,104182,95370
1351088,2014,121694,96802,105603,105652,112448,115978,129616,126296,119030,111754,105566,100649
1336908,2015,120373,99169,105792,103110,105254,115681,130945,123296,116428,112839,106319,97702
1316204,2016,114274,100640,105166,101947,104080,117994,120126,124833,114366,107951,104959,99868
1299419,2017,114968,95567,101700,96132,106274,115827,122894,122386,110811,108538,104386,99936
1255258,2018,107530,90002,101283,94776,104719,110383,117967,116715,107105,107818,100436,96524
1188524,2019,104044,85510,96631,93013,105166,97965,112628,109182,99981,98320,92936,93148
1115821,2020,94888,83433,89503,88526,93159,99232,105970,100478,96018,93428,87540,83646
1079842,2021,80733,77535,86214,82789,88506,94266,99252,100407,97334,93290,92189,87327

## Sütunları Atla

## usecols Parametresi

Bir Excel çalışma sayfasını, Pandas Veri Çerçevesine (DataFrame'e) dönüştürürken, bazı sütunları atlamamız / göz ardı etmemiz gerekebilir, bunu **usecols** parametresi kullanarak yapabiliriz. Bu parametre, tamsayı (int), metin (str), list-like veya callable (varsayılan None) değerlerini alır. Sütun adlarının veya konumlarının listesini belirtmek için, bir dize (string) listesi veya bir tamsayı (int) listesi kullanmalıyız.

Aylara Göre Doğum Sayıları tablosunu yukarıda görmüştük. Bu tabloda 14 sütun bulunmaktadır. Sadece istediğimiz aylara ait sütun bilgilerini görüntülemek istersek **usecols** parametresine ya **ay isimlerini** ya da **ayın sütun indis değerini** yazmamız gerekir. Her iki kullanımı da görelim.

In [40]:
dogumlar = pd.read_excel("Veri_Setleri/AyaGöreDoğumlar.xlsx", usecols=["Yıl", "Ocak", "Haziran", "Ağustos"])
dogumlar.head()

    Yıl    Ocak  Haziran  Ağustos
0  2001  170397   111722   120963
1  2002  155065   102627   108061
2  2003  138670   104644   109159
3  2004  141538   105728   110425
4  2005  142311   108536   111430

In [41]:
dogumlar = pd.read_excel("Veri_Setleri/AyaGöreDoğumlar.xlsx", usecols=[0,2,7,9])
dogumlar.head()

    Yıl    Ocak  Haziran  Ağustos
0  2001  170397   111722   120963
1  2002  155065   102627   108061
2  2003  138670   104644   109159
3  2004  141538   105728   110425
4  2005  142311   108536   111430

**usecols** parametresine, <u>sütun isimlerini yazarken</u>, sütun isimleri metinsel (string) ifade olduğu için **çift tırnak işareti "** kullandığımıza, <u>indis değeri yazarken</u> , indis değerleri tamsayı (int) olduğu için, tırnak işareti kullanmadığımıza dikkat edin.

Ayrıca, **usecols** parametresini, sütun aralığı belirterek te kullanabiliriz. Veri çerçevemizin sütunlarını, Excel programının sütun isimleri gibi (A, B, C,... şeklinde) düşünerek aralık belirtebiliriz. Aşağıdaki örnek, ne demek istediğimi daha net anlatacaktır.

In [42]:
dogumlar = pd.read_excel("Veri_Setleri/AyaGöreDoğumlar.xlsx", usecols="C:G")
dogumlar.head()

     Ocak   Şubat    Mart   Nisan   Mayıs
0  170397  103476  107912  102585  110391
1  155065  103446  102175   95976   99501
2  138670   89548  101046   92574   99531
3  141538   94596  100696  100801  102214
4  142311   94234  100529   97441  106833

Oluşturduğumuz Veri Çerçevemizdeki **Yıl** Sütunu **A**'ya, **Toplam** sütunu **B**'ye, **Ocak** Sütunu da **C**'ye denk geldiği için, çıktımız **Ocak** Ayından başlayıp **G** sütununa denk gelen **Mayıs** ayına kadar olan aralığı alarak çıktı olarak bize sundu.

## Satırları Atla

## skiprows Parametresi

Bir Excel çalışma sayfasını, Pandas Veri Çerçevesine (DataFrame'e) dönüştürürken, bazı satırları atlamamız / göz ardı etmemiz gerekebilir, bunu **skiprows** parametresi kullanarak yapabiliriz. Bu, parametre olarak, list-like, tamsayı (int) veya callable (isteğe bağlı) değerlerini alır. Bu parametre ile ilk birkaç satırı, seçilen satırı ve belirttiğimiz satır aralığını atlayabiliriz.

In [43]:
basliksiz = pd.read_excel("Veri_Setleri/SatırAtla.xlsx")
basliksiz.head(10)

                  Unnamed: 0 Unnamed: 1 Unnamed: 2    Unnamed: 3
0                        mhg        NaN        NaN           NaN
1                        NaN        NaN        654           NaN
2                        NaN        NaN        NaN           NaN
3                   Film_Adı        Yıl       Puan  Oylayan_Kişi
4  The Shawshank Redemption        1994        9,2       1071904
5             The Godfather        1972        9,2        751381
6    The Godfather: Part II        1974          9        488889
7              Pulp Fiction        1994        8,9        830504
8           The Dark Knight        2008        8,9       1045186
9              12 Angry Men        1957        8,9        264112

Atlamak / gözardı etmek istediğimiz satırları tek tek te belirtebiliriz.

In [44]:
basliksiz = pd.read_excel("Veri_Setleri/SatırAtla.xlsx", skiprows=[0,1,2,3,5,8,10,12])
basliksiz.head(10)

                                            Film_Adı   Yıl Puan  Oylayan_Kişi
0                                     The Godfather   1972  9,2        751381
1                            The Godfather: Part II   1974    9        488889
2                                   The Dark Knight   2008  8,9       1045186
3                                  Schindler's List   1993  8,9        545703
4                                        Fight Club   1999  8,8        814389
5    Star Wars: Episode V - The Empire Strikes Back   1980  8,8        519895
6  The Lord of the Rings: The Fellowship of the R...  2001  8,8        784999
7                   One Flew Over the Cuckoo's Nest   1975  8,7        447005
8                                        Goodfellas   1990  8,7        465445
9                                     Seven Samurai   1954  8,7        161969

## Sütun Ekle

Veri çerçevesine yeni bir sütun ekleyip bu sütuna değer atamak mümkündür. Bunu şu yöntemle yapabiliriz.

***Veri_Çerçevesi_Adı["Yeni_Sütun_Adı"] = Atanacak_Değerler***

Örneğin NBA oyuncularının çeşitli bilgilerinin bulunduğu veri çerçevesinden, yıllık kazanç miktarlarını (**Salary**) 12'ye bölerek aylık kazançlarını hesaplayarak, **Aylık Kazanç** isimli yeni sütuna yazmaya çalışalım.
Önce Veri çerçevemizin orijinal haline göz atalım.

In [45]:
veri = pd.read_csv("Veri_Setleri/nba.csv")
veri

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...,...
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

Şimdi istediğimizi yapmaya (yıllık kazanç miktarlarını (**Salary**) 12'ye bölerek aylık kazançları, **Aylık Kazanç** isimli yeni sütuna yazmaya) sıra geldi.

In [46]:
veri["Aylık Kazanç"] = veri["Salary"] / 12
veri

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,Aylık Kazanç
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0,644194.750000
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0,566343.083333
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0,95720.000000
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0,416666.666667
...,...,...,...,...,...,...,...,...,...,...
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0,202777.750000
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0,75000.000000
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0,241666.666667
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0,78939.666667
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

## Satır ya da Sütun Sil

Veri çerçevesine ekleme yapılabildiği gibi, silme / çıkarma işlemi de yapılabiliyor.
Bunun için **drop()** metodu kullanılıyor.

## drop() Metodu

Bu metodun kullanım/yazım şekli aşağıdaki gibidir.

***Veri_Çerçevesi_Adı.drop("Satır ya da Sütun Adı", axis = 0 ya da 1, inplace = True ya da False)***

* **Satır ya da Sütun Adı**, adından belli olduğu üzere, silinecek sütunun adıdır. Birden fazla sütun silinmek istenirse, isimler liste şeklinde yani köşeli parantez içinde yazılmalıdır.

### axis Parametresi
Sıfır **(0)** Satırları, Bir **(1)** Sütunları temsil eder. Varsayılan (default) değeri 0'dır. Aynı isme ait satır ve sütun bilgisi olması durumunda, bu parametre satırın mı, sütunun  mu silinmesi gerektiği konusunda bize yardımcı olur.
### inplace Parametresi
Gerçekleştirilen silme işleminin veri çerçevesinde kalıcı ya da geçici olmasını ayarladığımız kısımdır. **inplace = True** yazılırsa, yapılan işlem kalıcı hale gelecektir.

NBA oyuncularının bilgilerinin bulunduğu veri çerçevesinden, **Yaş (Age)** bilgisini silmeye çalışalım.

In [47]:
veri.drop("Age", axis = 1, inplace=True)
veri

,Name,Team,Number,Position,Height,Weight,College,Salary,Aylık Kazanç
0,Avery Bradley,Boston Celtics,0.0,PG,6-2,180.0,Texas,7730337.0,644194.750000
1,Jae Crowder,Boston Celtics,99.0,SF,6-6,235.0,Marquette,6796117.0,566343.083333
2,John Holland,Boston Celtics,30.0,SG,6-5,205.0,Boston University,NaN,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,6-5,185.0,Georgia State,1148640.0,95720.000000
4,Jonas Jerebko,Boston Celtics,8.0,PF,6-10,231.0,NaN,5000000.0,416666.666667
...,...,...,...,...,...,...,...,...,...
453,Shelvin Mack,Utah Jazz,8.0,PG,6-3,203.0,Butler,2433333.0,202777.750000
454,Raul Neto,Utah Jazz,25.0,PG,6-1,179.0,NaN,900000.0,75000.000000
455,Tibor Pleiss,Utah Jazz,21.0,C,7-3,256.0,NaN,2900000.0,241666.666667
456,Jeff Withey,Utah Jazz,24.0,C,7-0,231.0,Kansas,947276.0,78939.666667
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

Gördüğünüz gibi veri çerçevemizde artık Oyuncuların Yaş bilgilerini barındıran **Age** isimli sütun bulunmuyor, tamemiyle silindi.

Birden fazla satır ya da sütun silmek istediğimiz zaman ....